#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws-cost-slack.module.lambda.data.external.built will be read during apply
  # (config refers to values not yet known)
 <= data "external" "built"  {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/aws-cost-slack.lambda/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/0d040bcf6acbbfe1745b5264ab9812ec8315d570dea1b5e30fcf48e1a37e073f.zip' 'python3.6' '/terraform/modules/aws-cost-slack/aws-billing-to-slack/handler.py'"
          + "filename_new"   = "builds/0d040bcf6acbbfe1745b5264ab9812ec8315d570dea1b5e30fcf48e1a37e073f.zip"
          + "filename_old"   = "builds/0d040bcf6acbbfe1745b5264ab9812ec8315d570dea1b5e30fcf48e1a37e073f.zip"
          + "module_relpath" = ".terraform/modules/aws-cost-slack.lambda"
        }
      + result  = (known after apply)
    }

  # module.aws-cost-slack.module.lambda.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "aws-cost-slack-logs"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:589845989135:log-group:/aws/lambda/aws-cost-slack:*:*",
                          + "arn:aws:logs:*:589845989135:log-group:/aws/lambda/aws-cost-slack:*",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.aws-cost-slack.module.lambda.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "aws-cost-slack-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "aws-cost-slack",
        ]
    }

  # module.aws-cost-slack.module.lambda.aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aws-cost-slack"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.aws-cost-slack.module.lambda.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + arn                            = (known after apply)
      + description                    = "Deployment deploy status task"
      + filename                       = (known after apply)
      + function_name                  = "aws-cost-slack"
      + handler                        = "handler.report_cost"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.6"
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + timeout                        = 300
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.aws-cost-slack.module.lambda.null_resource.archive will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/0d040bcf6acbbfe1745b5264ab9812ec8315d570dea1b5e30fcf48e1a37e073f.zip"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
